//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int i = 7;

if (i %2 == 0)
{
    Console.WriteLine("да");
}
else
{
    Console.Write("нет");
}
